Revit 2027 API
Rebar.SetLayoutFormula Method
 Sets the specified formula for custom spacing.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutFormula(
	string customSpacingFormula
)
Public Sub SetLayoutFormula (
	customSpacingFormula As String
)
public:
void SetLayoutFormula(
	String^ customSpacingFormula
)
member SetLayoutFormula :
        customSpacingFormula : string -> unit
Parameters
customSpacingFormula String
 The formula that will be set.
Exceptions
Exception | Condition
ArgumentException |  The specified formula is not valid (doesn't have a valid syntax). -or- The formula determines an array length of the Rebar set that is not between (0, 10000] feet.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Rebar should have CustomSpacing layout.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace